Revit 2024 API
ZoneEquipmentData.IsDataCompleted Method
 Is the required data completed for this zone equipment?
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public bool IsDataCompleted()
Visual Basic
Public Function IsDataCompleted As Boolean
Visual C++
public:
bool IsDataCompleted()
See Also
ZoneEquipmentData Class
Autodesk.Revit.DB.Mechanical Namespace